> tuple()
> tuple()
()
> 20,30,40
(20, 30, 40)
> num= 20,30,40
> num
(20, 30, 40)
> v1,v2,v3= num 
> v1
20
> v2
30
> v3
40
> num1,num2=(20,30,40,50)
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
ValueError: too many values to unpack (expected 2)
> (1,2,3)+(4,5,6)
(1, 2, 3, 4, 5, 6)
> a1=(1,2,3)
> a1
(1, 2, 3)
> a2=(4,5,6)
> a2
(4, 5, 6)
> a1+a2
(1, 2, 3, 4, 5, 6)
> a1
(1, 2, 3)
> a2
(4, 5, 6)
> t=(20,40,60,80,100)
> t
(20, 40, 60, 80, 100)
> t2=frozenset(t)
> t2
frozenset({100, 40, 80, 20, 60})
> t.add(100)
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
AttributeError: 'tuple' object has no attribute 'add'
> t=(10,20,40,60,70,70,80,80)
> t
(10, 20, 40, 60, 70, 70, 80, 80)
> t1=frozenset(t)
> t1
frozenset({70, 40, 10, 80, 20, 60})
> range(11)
range(0, 11)
> range(0,11)
range(0, 11)
> list(range(15))
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]
> list(range(0,15,2))
[0, 2, 4, 6, 8, 10, 12, 14]
> list(range(-10,-1))
[-10, -9, -8, -7, -6, -5, -4, -3, -2]
> list(range(-18,-2,-2))
[]
> list(range(-2,-18,-1))
[-2, -3, -4, -5, -6, -7, -8, -9, -10, -11, -12, -13, -14, -15, -16, -17]
> list(range(-1,-18,-2))
[-1, -3, -5, -7, -9, -11, -13, -15, -17]
>